# Import software libraries

In [1]:
import sys           # Read system parameters.
import pandas as pd  # Manipulate and analyze data.
import sqlite3       # Manage SQL databases.

# Summarize software libraries used.
print('Libraries used in this project:')
print('- Python {}'.format(sys.version))
print('- pandas {}'.format(pd.__version__))
print('- sqlite3 {}'.format(sqlite3.sqlite_version))

Libraries used in this project:
- Python 3.9.6 (default, Mar 10 2023, 20:16:38)
[Clang 14.0.3 (clang-1403.0.22.14.1)]
- pandas 2.0.0
- sqlite3 3.39.5

# Load a CSV file as a `DataFrame`

In [2]:
Divvy_Trips_2019_Q2 = pd.read_csv('/Users/jiawenzhu/Developer/Google Analyst Case Study/data/Divvy_Trips_2019_Q2.csv')
Divvy_Trips_2019_Q3 = pd.read_csv('/Users/jiawenzhu/Developer/Google Analyst Case Study/data/Divvy_Trips_2019_Q3.csv')
Divvy_Trips_2019_Q4 = pd.read_csv('/Users/jiawenzhu/Developer/Google Analyst Case Study/data/Divvy_Trips_2019_Q4.csv')
Divvy_Trips_2020_Q1 = pd.read_csv('/Users/jiawenzhu/Developer/Google Analyst Case Study/data/Divvy_Trips_2020_Q1.csv')

# Preview the first three rows of the data

In [3]:
Divvy_Trips_2019_Q2.head(3)

,01 - Rental Details Rental ID,01 - Rental Details Local Start Time,01 - Rental Details Local End Time,01 - Rental Details Bike ID,01 - Rental Details Duration In Seconds Uncapped,03 - Rental Start Station ID,03 - Rental Start Station Name,02 - Rental End Station ID,02 - Rental End Station Name,User Type,Member Gender,05 - Member Details Member Birthday Year
0,22178529,2019-04-01 00:02:22,2019-04-01 00:09:48,6251,446.0,81,Daley Center Plaza,56,Desplaines St & Kinzie St,Subscriber,Male,1975.0
1,22178530,2019-04-01 00:03:02,2019-04-01 00:20:30,6226,"1,048.0",317,Wood St & Taylor St,59,Wabash Ave & Roosevelt Rd,Subscriber,Female,1984.0
2,22178531,2019-04-01 00:11:07,2019-04-01 00:15:19,5649,252.0,283,LaSalle St & Jackson Blvd,174,Canal St & Madison St,Subscriber,Male,1990.0

# Create a connection to the SQLite database

In [4]:
conn = sqlite3.connect('Google Analyst Case Study/data/user_data.db')
conn

# Read the `users` data

In [5]:
# Write a query that selects everything from the users table.
query = 'SELECT * FROM users'

In [6]:
# Read the query into a DataFrame.
users = pd.read_sql(query, conn)


# Preview the data.
users.head()

,user_id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,58,management,married,tertiary,no,yes,no,None,261,1,-1,0,None,no,1998-08-23
1,bb92765a-08de-4963-b432-496524b39157,44,technician,single,secondary,no,yes,no,None,151,1,-1,0,None,no,2008-07-15
2,573de577-49ef-42b9-83da-d3cfb817b5c1,33,entrepreneur,married,secondary,no,yes,yes,None,76,1,-1,0,None,no,2002-06-04
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,47,blue-collar,married,None,no,yes,no,None,92,1,-1,0,None,no,1995-06-29
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,33,None,single,None,no,no,no,None,198,1,-1,0,None,no,1995-08-01

In [7]:
# Check the shape of the data.

# Read the `device` data

In [8]:
query = 'SELECT * FROM device'

device = pd.read_sql(query, conn)

In [9]:
device.head(5)

                                user_id   device
0  9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6   mobile
1  bb92765a-08de-4963-b432-496524b39157  desktop
2  573de577-49ef-42b9-83da-d3cfb817b5c1   mobile
3  d6b66b9d-7c8f-4257-a682-e136f640b7e3   tablet
4  fade0b20-7594-4d9a-84cd-c02f79b1b526   mobile

# Read the `transactions` data

In [10]:
# Read the user transactions in the last 30 days. 
query = '''
        SELECT trans.*, users.date_joined
        FROM transactions AS trans
        LEFT JOIN users ON trans.user_id = users.user_id
        WHERE users.date_joined >= Date('now', '-13 years')
        GROUP BY users.date_joined
        ORDER BY trans.amount_usd DESC
        '''
transactions = pd.read_sql(query, conn)

In [11]:
transactions

,user_id,transaction_id,amount_usd,date_joined
0,2df9a93f-7550-45d0-94e1-aa636960ea24,transaction_5761,4448,2010-09-18
1,fdd6d434-39ca-4f14-8cb1-e2dd25f3b012,transaction_4943,2561,2010-10-23
2,064127f3-f625-4272-8c83-65d6e271d57c,transaction_4840,2529,2010-11-29
3,e4b7acb3-a099-4d73-b905-e57c623e9133,transaction_4733,2469,2010-09-03
4,18ea0eae-265b-4f3c-8024-f64c95b83eec,transaction_5814,2405,2010-09-28
...,...,...,...,...
214,20b92ff3-55f9-4cbe-a006-d6b304a72aa0,transaction_4915,-172,2010-06-17
215,c55f104a-dd98-42d6-8dcb-253149fba805,transaction_4542,-194,2010-08-31
216,c0e5d09f-603b-4e6d-b911-4e14e0ff8dae,transaction_4817,-501,2010-10-19
217,5e8112c5-cc17-4b7c-902b-ed50c992e0f7,transaction_4934,-522,2010-08-17
218,f035d57b-6ab6-4044-86f9-0cb0d9e38028,transaction_4546,-601,2010-09-17

# Aggregate the `transactions` data

In [12]:
# Aggregate data on the number of transactions and the total amount.

query = '''
        SELECT users.user_id, trans.transaction_id, SUM(trans.amount_usd) as total_amount, users.date_joined
        FROM transactions AS trans
        LEFT JOIN users ON trans.user_id = users.user_id
        
        WHERE users.date_joined >= Date('2010-11-30', '-1 month')
        GROUP BY users.date_joined
        ORDER BY total_amount DESC
        '''

aggregation_of_transactions = pd.read_sql(query, conn)

In [13]:
aggregation_of_transactions

,user_id,transaction_id,total_amount,date_joined
0,45033378-0d23-4bea-9142-64dd6a51b51f,transaction_4719,28709,2010-11-17
1,a5320beb-c5c9-4e5e-b207-3164282a3b7a,transaction_4614,18524,2010-11-02
2,c9304a7f-6dea-40c7-ba35-85afa2c35185,transaction_5208,17400,2010-11-04
3,00d6e3e9-ec1c-4f3c-9d6e-48d0456d4542,transaction_4743,16396,2010-11-21
4,e4acab7d-b7f4-4018-ac24-b523bf60d8d3,transaction_5291,15998,2010-11-30
5,c7329e7c-ed10-4314-87c1-03a4a369829b,transaction_4894,14810,2010-11-20
6,7eac59b2-2f8f-4e3b-9f14-fdb474950688,transaction_4712,9384,2010-11-03
7,18fae5bc-59cd-4e9c-9650-ea475aeebf64,transaction_6464,9114,2010-11-06
8,064127f3-f625-4272-8c83-65d6e271d57c,transaction_4840,9102,2010-11-29
9,1bd4d419-0273-4e37-a289-a83962d5df6c,transaction_5362,7369,2010-11-23
10,df7960e9-a5f9-42ed-9b4b-5c0ee8c35676,transaction_5880,6848,2010-11-27
11,cb9aafda-3ed3-4897-ab85-c917f3d3cd0b,transaction_5186,6801,2010-11-16
12,deb465a8-9b8f-49b8-a2de-72e621a0aa56,transaction_4577,5405,2010-11-13
13,81ad39ff-b394-4e9f-849e-a00c4a39c92e,transaction_4656,4368,2010-11-25
14,ebce2a5d-7e1e-475b-8747-a1e62ae83574,transaction_5642,4011,2010-11-01
15,69704567-3ce3-4700-8c0c-358d3ed7b425,transaction_4538,3961,2010-11-11
16,f9f33f6c-5aeb-4302-b71f-e24d3cede51e,transaction_5929,3635,2010-11-19
17,b037cf76-aed4-4b21-9aed-ffb5778ab516,transaction_4607,3624,2010-10-30
18,ba2264ea-ebd7-40f8-aa85-d9fa25591367,transaction_6801,3544,2010-11-12
19,72d4a68d-b45e-4eb7-8f9c-b68f891aa27a,transaction_4531,3295,2010-11-18
20,c3d604f0-e1e5-4be2-a653-456f96215083,transaction_5169,2910,2010-11-24
21,b47ebac1-0055-4d6f-90d3-abc2cb6819e6,transaction_4654,2190,2010-11-05
22,f60a2519-bc91-4164-aebe-2d7f57347ce0,transaction_4724,2174,2010-11-22
23,bc50c7f9-2ab6-4414-90c3-8d117feca997,transaction_4653,1722,2010-10-31
24,eb6f9626-a3e2-4cba-b21f-73697cb1d2d4,transaction_6019,1698,2010-11-14
25,3ef8461d-7da9-4c65-940f-c32cefcc7edc,transaction_5195,1414,2010-11-15
26,e3bb6e56-b307-417c-953d-8f03486d6982,transaction_4594,1017,2010-11-07
27,b1781566-5b9f-4782-a5f3-a3ce2b4b6839,transaction_4707,603,2010-11-28
28,d0c10c95-413c-4299-b1ac-35aacc22412d,transaction_4579,576,2010-11-26
29,fd48351b-58fd-4ed4-9be6-17af83a701b5,transaction_5176,565,2010-11-08
30,b78a8add-a972-4f90-81b5-42a6a96f01d1,transaction_5662,521,2010-11-10
31,eeeeafa1-aced-430a-8d21-c105326aa2fe,transaction_5933,513,2010-11-09

# Merge the `device` table with the `users` table

In [14]:
# Do a left join, as all users in the users table are of interest.
query = '''
        SELECT users.*, device.device
        FROM users
        LEFT JOIN device
        ON users.user_id = device.user_id
        '''
users_w_device = pd.read_sql(query, conn)

In [23]:
users_w_device.head(10)

,user_id,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,58,management,married,tertiary,no,yes,no,None,261,1,-1,0,None,no,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,44,technician,single,secondary,no,yes,no,None,151,1,-1,0,None,no,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,33,entrepreneur,married,secondary,no,yes,yes,None,76,1,-1,0,None,no,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,47,blue-collar,married,None,no,yes,no,None,92,1,-1,0,None,no,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,33,None,single,None,no,no,no,None,198,1,-1,0,None,no,1995-08-01,mobile
5,c6aee0d4-2a86-4bac-827b-c6d33b5933e6,35,management,married,tertiary,no,yes,no,None,139,1,-1,0,None,no,2000-06-21,desktop
6,1fa7d4fb-3e4a-463a-ba4b-08f824945e45,28,management,single,tertiary,no,yes,yes,None,217,1,-1,0,None,no,1996-02-22,mobile
7,d20059f3-84b7-4ec5-b933-8bca3a3414af,42,entrepreneur,divorced,tertiary,yes,yes,no,None,380,1,-1,0,None,no,1991-12-09,mobile
8,0cedabc3-6141-43c6-988c-9ec2f14a8eb9,58,retired,married,primary,no,yes,no,None,50,1,-1,0,None,no,1999-08-20,desktop
9,bc3d8e25-4619-4395-9aae-7d443f424802,43,technician,single,secondary,no,yes,no,None,55,1,-1,0,None,no,1991-09-16,mobile

In [24]:
users_w_device.shape

(45216, 17)

# Close the database connection

In [16]:
conn.close()

# Merge `users_w_device` with `transactions_agg`

In [32]:
# Do a right join so users won't be lost.
users_w_devices_and_transactions = pd.merge(transactions, users_w_device, on="user_id", how="right")

users_w_devices_and_transactions.head()

,user_id,transaction_id,amount_usd,date_joined_x,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined_y,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,NaN,NaN,NaN,58,management,married,tertiary,no,yes,no,None,261,1,-1,0,None,no,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,NaN,44,technician,single,secondary,no,yes,no,None,151,1,-1,0,None,no,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,NaN,NaN,NaN,33,entrepreneur,married,secondary,no,yes,yes,None,76,1,-1,0,None,no,2002-06-04,mobile
3,d6b66b9d-7c8f-4257-a682-e136f640b7e3,NaN,NaN,NaN,47,blue-collar,married,None,no,yes,no,None,92,1,-1,0,None,no,1995-06-29,tablet
4,fade0b20-7594-4d9a-84cd-c02f79b1b526,NaN,NaN,NaN,33,None,single,None,no,no,no,None,198,1,-1,0,None,no,1995-08-01,mobile

In [43]:
# Make sure number of rows is equal to users_w_devices table.
users_w_devices_and_transactions.shape

(45216, 20)

# Identify data where `age` is greater than 150

In [41]:
users_w_devices_and_transactions[users_w_devices_and_transactions.age > 150]

,user_id,transaction_id,amount_usd,date_joined_x,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined_y,device
7228,44fefdad-7045-4be5-890e-12e84ae6fdc9,NaN,NaN,NaN,178,blue-collar,married,primary,no,yes,no,None,691,1,-1,0,None,no,1997-04-28,desktop
10318,9b2cd5d2-900e-4052-831f-6489f6d568af,NaN,NaN,NaN,891,management,married,tertiary,no,yes,no,None,278,2,-1,0,None,no,2003-10-03,mobile

# Drop incorrect data

In [45]:
users_w_devices_and_transactions_cleaned_table = users_w_devices_and_transactions[users_w_devices_and_transactions.age<150]

users_cleaned = users_w_devices_and_transactions_cleaned_table
users_cleaned.shape

(45214, 20)

# Identify more potentially erroneous data

In [46]:
# Compare age to device.
pd.crosstab(users_cleaned['age'], users_cleaned['device'])

device  desktop  mobile  tablet
age
18            5       6       1
19           10      22       3
20           11      33       6
21           16      44      19
22           30      87      11
..          ...     ...     ...
90            1       1       0
92            1       1       0
93            0       2       0
94            0       1       0
95            0       1       1

[77 rows x 3 columns]

# Identify data types that need correcting

In [47]:
users_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
Index: 45214 entries, 0 to 45215
Data columns (total 20 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   user_id         45214 non-null  object
 1   transaction_id  219 non-null    object
 2   amount_usd      219 non-null    float64
 3   date_joined_x   219 non-null    object
 4   age             45214 non-null  int64
 5   job             44926 non-null  object
 6   marital         45214 non-null  object
 7   education       43357 non-null  object
 8   default         45214 non-null  object
 9   housing         45214 non-null  object
 10  loan            45214 non-null  object
 11  contact         32196 non-null  object
 12  duration        45214 non-null  int64
 13  campaign        45214 non-null  int64
 14  pdays           45214 non-null  int64
 15  previous        45214 non-null  int64
 16  poutcome        8255 non-null   object
 17  term_deposit    45214 non-null  object
 18  date_joined_y   45184 non-null  object
 19  device          45120 non-null  object
dtypes: float64(1), int64(5), object(14)
memory usage: 7.2+ MB

In [54]:
users_cleaned.default.value_counts()

default
no     44398
yes      816
Name: count, dtype: int64

# Convert the relevant variables to a Boolean type

In [71]:
users_cleaned_1 = users_cleaned.copy()

users_cleaned_1['default'] = \
users_cleaned_1['default'].map(dict(yes=1, no=0)).astype(bool)

users_cleaned_1['default'].value_counts()

default
False    44398
True       816
Name: count, dtype: int64

In [91]:
# Do the same for the other Boolean variables.

bool_vars = ['housing', 'loan', 'term_deposit']

for var in bool_vars:
    users_cleaned_1[var] = \
    users_cleaned_1[var].map(dict(yes=1, no=0)).astype(bool)
    print(users_cleaned_1[var].value_counts())

housing
True     25131
False    20083
Name: count, dtype: int64
loan
False    37970
True      7244
Name: count, dtype: int64
term_deposit
False    39925
True      5289
Name: count, dtype: int64

In [92]:
users_cleaned_1.info

<bound method DataFrame.info of                                     user_id transaction_id  amount_usd
0      9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6            NaN         NaN  \
1      bb92765a-08de-4963-b432-496524b39157            NaN         NaN
2      573de577-49ef-42b9-83da-d3cfb817b5c1            NaN         NaN
3      d6b66b9d-7c8f-4257-a682-e136f640b7e3            NaN         NaN
4      fade0b20-7594-4d9a-84cd-c02f79b1b526            NaN         NaN
...                                     ...            ...         ...
45211  cba59442-af3c-41d7-a39c-0f9bffba0660            NaN         NaN
45212  1e826721-b38c-41c2-88f4-4c28b335b1e6            NaN         NaN
45213  a2fb8264-d55a-437b-a8e7-9ec4116b76f4            NaN         NaN
45214  ae3b92a2-cad8-434f-8037-9815e2228839            NaN         NaN
45215  f49ac08f-b872-4d57-ac82-9b8a9144020d            NaN         NaN

      date_joined_x  age           job  marital  education  default  housing
0               NaN   58    management  married   tertiary    False     True  \
1               NaN   44    technician   single  secondary    False     True
2               NaN   33  entrepreneur  married  secondary    False     True
3               NaN   47   blue-collar  married       None    False     True
4               NaN   33          None   single       None    False    False
...             ...  ...           ...      ...        ...      ...      ...
45211           NaN   57    management  married   tertiary     True     True
45212           NaN   31    technician   single  secondary    False    False
45213           NaN   34    management  married   tertiary    False    False
45214           NaN   43        admin.   single  secondary    False     True
45215           NaN   38   blue-collar  married  secondary    False     True

        loan   contact  duration  campaign  pdays  previous poutcome
0      False      None       261         1     -1         0     None  \
1      False      None       151         1     -1         0     None
2       True      None        76         1     -1         0     None
3      False      None        92         1     -1         0     None
4      False      None       198         1     -1         0     None
...      ...       ...       ...       ...    ...       ...      ...
45211  False  cellular       317         6     -1         0     None
45212  False  cellular       129         1     -1         0     None
45213  False  cellular       156         1    177         1  success
45214  False  cellular        76         2    304         2  failure
45215  False  cellular        54         1    337         1  failure

       term_deposit date_joined_y   device
0             False    1998-08-23   mobile
1             False    2008-07-15  desktop
2             False    2002-06-04   mobile
3             False    1995-06-29   tablet
4             False    1995-08-01   mobile
...             ...           ...      ...
45211         False    1993-02-27  desktop
45212         False    1990-05-10   mobile
45213         False    1989-09-02   mobile
45214         False    1992-10-29  desktop
45215         False    2010-06-11   mobile

[45214 rows x 20 columns]>

# Convert `date_joined` to a datetime format

In [104]:
  # Work with a new object.
users_cleaned_2 = users_cleaned_1.copy()
pd.to_datetime(users_cleaned_2['date_joined_y'], format="%Y-%m-%d")

0       1998-08-23
1       2008-07-15
2       2002-06-04
3       1995-06-29
4       1995-08-01
           ...
45211   1993-02-27
45212   1990-05-10
45213   1989-09-02
45214   1992-10-29
45215   2010-06-11
Name: date_joined_y, Length: 45214, dtype: datetime64[ns]

In [107]:
users_cleaned_2.info

<bound method DataFrame.info of                                     user_id transaction_id  amount_usd
0      9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6            NaN         NaN  \
1      bb92765a-08de-4963-b432-496524b39157            NaN         NaN
2      573de577-49ef-42b9-83da-d3cfb817b5c1            NaN         NaN
3      d6b66b9d-7c8f-4257-a682-e136f640b7e3            NaN         NaN
4      fade0b20-7594-4d9a-84cd-c02f79b1b526            NaN         NaN
...                                     ...            ...         ...
45211  cba59442-af3c-41d7-a39c-0f9bffba0660            NaN         NaN
45212  1e826721-b38c-41c2-88f4-4c28b335b1e6            NaN         NaN
45213  a2fb8264-d55a-437b-a8e7-9ec4116b76f4            NaN         NaN
45214  ae3b92a2-cad8-434f-8037-9815e2228839            NaN         NaN
45215  f49ac08f-b872-4d57-ac82-9b8a9144020d            NaN         NaN

      date_joined_x  age           job  marital  education  default  housing
0               NaN   58    management  married   tertiary    False     True  \
1               NaN   44    technician   single  secondary    False     True
2               NaN   33  entrepreneur  married  secondary    False     True
3               NaN   47   blue-collar  married       None    False     True
4               NaN   33          None   single       None    False    False
...             ...  ...           ...      ...        ...      ...      ...
45211           NaN   57    management  married   tertiary     True     True
45212           NaN   31    technician   single  secondary    False    False
45213           NaN   34    management  married   tertiary    False    False
45214           NaN   43        admin.   single  secondary    False     True
45215           NaN   38   blue-collar  married  secondary    False     True

        loan   contact  duration  campaign  pdays  previous poutcome
0      False      None       261         1     -1         0     None  \
1      False      None       151         1     -1         0     None
2       True      None        76         1     -1         0     None
3      False      None        92         1     -1         0     None
4      False      None       198         1     -1         0     None
...      ...       ...       ...       ...    ...       ...      ...
45211  False  cellular       317         6     -1         0     None
45212  False  cellular       129         1     -1         0     None
45213  False  cellular       156         1    177         1  success
45214  False  cellular        76         2    304         2  failure
45215  False  cellular        54         1    337         1  failure

       term_deposit date_joined_y   device
0             False    1998-08-23   mobile
1             False    2008-07-15  desktop
2             False    2002-06-04   mobile
3             False    1995-06-29   tablet
4             False    1995-08-01   mobile
...             ...           ...      ...
45211         False    1993-02-27  desktop
45212         False    1990-05-10   mobile
45213         False    1989-09-02   mobile
45214         False    1992-10-29  desktop
45215         False    2010-06-11   mobile

[45214 rows x 20 columns]>

# Identify all duplicated data

In [145]:
duplicated_data = \
users_cleaned_2[users_cleaned_2.duplicated(keep=False)]
print(f'numer of rows with duplicated data: {duplicated_data.shape[0]}')

numer of rows with duplicated data: 10

In [146]:
duplicated_data

,user_id,transaction_id,amount_usd,date_joined_x,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined_y,device
15456,cba59442-af3c-41d7-a39c-0f9bffba0660,NaN,NaN,NaN,57,management,married,tertiary,True,True,False,cellular,317,6,-1,0,None,False,1993-02-27,desktop
22005,1e826721-b38c-41c2-88f4-4c28b335b1e6,NaN,NaN,NaN,31,technician,single,secondary,False,False,False,cellular,129,1,-1,0,None,False,1990-05-10,mobile
35413,a2fb8264-d55a-437b-a8e7-9ec4116b76f4,NaN,NaN,NaN,34,management,married,tertiary,False,False,False,cellular,156,1,177,1,success,False,1989-09-02,mobile
35620,f49ac08f-b872-4d57-ac82-9b8a9144020d,NaN,NaN,NaN,38,blue-collar,married,secondary,False,True,False,cellular,54,1,337,1,failure,False,2010-06-11,mobile
36292,ae3b92a2-cad8-434f-8037-9815e2228839,NaN,NaN,NaN,43,admin.,single,secondary,False,True,False,cellular,76,2,304,2,failure,False,1992-10-29,desktop
45211,cba59442-af3c-41d7-a39c-0f9bffba0660,NaN,NaN,NaN,57,management,married,tertiary,True,True,False,cellular,317,6,-1,0,None,False,1993-02-27,desktop
45212,1e826721-b38c-41c2-88f4-4c28b335b1e6,NaN,NaN,NaN,31,technician,single,secondary,False,False,False,cellular,129,1,-1,0,None,False,1990-05-10,mobile
45213,a2fb8264-d55a-437b-a8e7-9ec4116b76f4,NaN,NaN,NaN,34,management,married,tertiary,False,False,False,cellular,156,1,177,1,success,False,1989-09-02,mobile
45214,ae3b92a2-cad8-434f-8037-9815e2228839,NaN,NaN,NaN,43,admin.,single,secondary,False,True,False,cellular,76,2,304,2,failure,False,1992-10-29,desktop
45215,f49ac08f-b872-4d57-ac82-9b8a9144020d,NaN,NaN,NaN,38,blue-collar,married,secondary,False,True,False,cellular,54,1,337,1,failure,False,2010-06-11,mobile

# Remove the duplicated data

In [148]:
users_cleaned_fianl = \
users_cleaned_2[~users_cleaned_2.duplicated()]

In [159]:
check = users_cleaned_fianl['user_id'] == 'cba59442-af3c-41d7-a39c-0f9bffba0660'
check.value_counts() # there is only one value for user_id == cba59442-af3c-41d7-a39c-0f9bffba0660, no duplicated found

user_id
False    45208
True         1
Name: count, dtype: int64

# Load data into an SQL database

In [167]:
conn = sqlite3.connect('user_data_cleaned.db')

users_cleaned_fianl.to_sql('users_cleaned_fianl', conn, if_exists = 'replace', index = False)

45209

# Confirm that data was loaded into the database

In [173]:
query = "SELECT * FROM users_cleaned_fianl"
pd.read_sql(query, conn).shape

(45209, 20)

# Close the database connection

In [174]:
conn.close()

# Write the `DataFrame` as a pickle file

In [175]:
users_cleaned_fianl.to_pickle('users_data_cleaned.pickle')

# Confirm that the data was written to the pickle file

In [179]:
pd.read_pickle('users_data_cleaned.pickle').head(3)

,user_id,transaction_id,amount_usd,date_joined_x,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,term_deposit,date_joined_y,device
0,9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6,NaN,NaN,NaN,58,management,married,tertiary,False,True,False,None,261,1,-1,0,None,False,1998-08-23,mobile
1,bb92765a-08de-4963-b432-496524b39157,NaN,NaN,NaN,44,technician,single,secondary,False,True,False,None,151,1,-1,0,None,False,2008-07-15,desktop
2,573de577-49ef-42b9-83da-d3cfb817b5c1,NaN,NaN,NaN,33,entrepreneur,married,secondary,False,True,True,None,76,1,-1,0,None,False,2002-06-04,mobile

In [180]:
pd.read_pickle('users_data_cleaned.pickle').info

<bound method DataFrame.info of                                     user_id transaction_id  amount_usd
0      9231c446-cb16-4b2b-a7f7-ddfc8b25aaf6            NaN         NaN  \
1      bb92765a-08de-4963-b432-496524b39157            NaN         NaN
2      573de577-49ef-42b9-83da-d3cfb817b5c1            NaN         NaN
3      d6b66b9d-7c8f-4257-a682-e136f640b7e3            NaN         NaN
4      fade0b20-7594-4d9a-84cd-c02f79b1b526            NaN         NaN
...                                     ...            ...         ...
45206  a218c1d6-880a-4431-a314-a1bd3dc36b21            NaN         NaN
45207  6a6bf402-9416-4e71-97c6-727e8298a3a5            NaN         NaN
45208  be32ba96-b178-4b54-b32a-f75b714793df            NaN         NaN
45209  44623a48-4e9b-48fd-b155-a17d1c06a754            NaN         NaN
45210  5905741c-3f30-416f-8ee5-71abad035de6            NaN         NaN

      date_joined_x  age           job   marital  education  default  housing
0               NaN   58    management   married   tertiary    False     True  \
1               NaN   44    technician    single  secondary    False     True
2               NaN   33  entrepreneur   married  secondary    False     True
3               NaN   47   blue-collar   married       None    False     True
4               NaN   33          None    single       None    False    False
...             ...  ...           ...       ...        ...      ...      ...
45206           NaN   51    technician   married   tertiary    False    False
45207           NaN   71       retired  divorced    primary    False    False
45208           NaN   72       retired   married  secondary    False    False
45209           NaN   57   blue-collar   married  secondary    False    False
45210           NaN   37  entrepreneur   married  secondary    False    False

        loan    contact  duration  campaign  pdays  previous poutcome
0      False       None       261         1     -1         0     None  \
1      False       None       151         1     -1         0     None
2       True       None        76         1     -1         0     None
3      False       None        92         1     -1         0     None
4      False       None       198         1     -1         0     None
...      ...        ...       ...       ...    ...       ...      ...
45206  False   cellular       977         3     -1         0     None
45207  False   cellular       456         2     -1         0     None
45208  False   cellular      1127         5    184         3  success
45209  False  telephone       508         4     -1         0     None
45210  False   cellular       361         2    188        11    other

       term_deposit date_joined_y   device
0             False    1998-08-23   mobile
1             False    2008-07-15  desktop
2             False    2002-06-04   mobile
3             False    1995-06-29   tablet
4             False    1995-08-01   mobile
...             ...           ...      ...
45206          True    2002-12-28  desktop
45207          True    2010-11-18  desktop
45208          True    1996-06-18   mobile
45209         False    1996-09-14  desktop
45210         False    1994-04-28   mobile

[45209 rows x 20 columns]>

# Write the data to a CSV file

In [188]:
users_cleaned_fianl.to_csv('users_data_cleaned.csv', index=False)

# Confirm that the data was written to a CSV file.

In [190]:
users_cleaned_data = pd.read_csv('users_data_cleaned.csv')

In [193]:
users_cleaned_data.shape

(45209, 20)